gerenciamentocontas/app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? AND "accounts"."created_at" BETWEEN ? AND ?  [["user_id", 1], ["created_at", "2020-12-01 00:00:00"], ["created_at", "2020-12-08 00:00:00"]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? AND "accounts"."data_conta" BETWEEN ? AND ?  [["user_id", 1], ["data_conta", "2020-12-01"], ["data_conta", "2020-12-04"]]
SELECT SUM(qtd) FROM "accounts" WHERE "accounts"."user_id" = ? AND "accounts"."data_conta" BETWEEN ? AND ?  [["user_id", 1], ["data_conta", "2020-12-02"], ["data_conta", "2020-12-03"]]
SELECT SUM(qtd) FROM "accounts" WHERE "accounts"."user_id" = ? AND "accounts"."data_conta" BETWEEN ? AND ?  [["user_id", 1], ["data_conta", "2020-12-02"], ["data_conta", "2020-12-08"]]
SELECT SUM(quantidade) FROM "expenses" WHERE "expenses"."user_id" = ? AND "expenses"."data" BETWEEN ? AND ?  [["user_id", 1], ["data", "2020-12-02"], ["data", "2020-12-08"]]
SELECT "accounts".* FROM "accounts"
---
  def index
    @data_inicio = params[:data_inicio]
    @data_fim = params[:data_final]
    @total_contas_mes = 0
    @saldo_datas = 0
    if @data_inicio == "" and @data_fim == ""
      @accounts = Account.where(user_id: current_user.id)
    elsif @data_inicio and @data_fim
      @accounts = Account.where(user_id: current_user.id,:data_conta => @data_inicio..@data_fim)
      @total_contas_mes = Account.where(user_id: current_user.id,:data_conta => @data_inicio..@data_fim).pluck('SUM(qtd)')[0]
      @total_receitas_data = Expense.where(user_id: current_user.id,:data => @data_inicio..@data_fim).pluck('SUM(quantidade)')[0]
      if @total_contas_mes != 0 and @total_receitas_data.present?

INSERT INTO "accounts" ("qtd", "data_conta", "comentario", "created_at", "updated_at", "user_id", "accounttype_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @account = Account.new(account_params)
    @account.user_id = current_user.id

    respond_to do |format|
      if @account.save

UPDATE "accounts" SET "comentario" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["comentario", "Bombons"], ["updated_at", "2020-12-03 23:25:12.980247"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @account.update(account_params)

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_account
      @account = Account.find(params[:id])