gerenciamentocontas/app/controllers/accounttypes_controller.rb

SELECT "accounttypes".* FROM "accounttypes"
---
  def index
    @accounttypes = Accounttype.all

INSERT INTO "accounttypes" ("tipo_conta", "created_at", "updated_at") VALUES (?, ?, ?)  [["tipo_conta", "Luz"], ["created_at", "2020-12-01 13:32:37.291964"], ["updated_at", "2020-12-01 13:32:37.291964"]]
---
  def create
    @accounttype = Accounttype.new(accounttype_params)

    respond_to do |format|
      if @accounttype.save

SELECT "accounttypes".* FROM "accounttypes" WHERE "accounttypes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_accounttype
      @accounttype = Accounttype.find(params[:id])