gerenciamentocontas/app/controllers/expensetypes_controller.rb

  def index
    @expensetypes = Expensetype.all
---
SELECT "expensetypes".* FROM "expensetypes"

  def create
    @expensetype = Expensetype.new(expensetype_params)

    respond_to do |format|
      if @expensetype.save
---
INSERT INTO "expensetypes" ("tipo_receita", "created_at", "updated_at") VALUES (?, ?, ?)  [["tipo_receita", "Salário"], ["created_at", "2020-12-06 22:48:10.382437"], ["updated_at", "2020-12-06 22:48:10.382437"]]

    def set_expensetype
      @expensetype = Expensetype.find(params[:id])
---
SELECT "expensetypes".* FROM "expensetypes" WHERE "expensetypes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]