gerenciamentocontas/app/controllers/expenses_controller.rb

SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = ? AND 1=1  [["user_id", 1]]
SELECT SUM(quantidade) FROM "expenses" WHERE "expenses"."user_id" = ? AND 1=1  [["user_id", 1]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = ? AND "expenses"."data" BETWEEN ? AND ?  [["user_id", 1], ["data", "2020-12-03"], ["data", "2020-12-04"]]
SELECT SUM(quantidade) FROM "expenses" WHERE "expenses"."user_id" = ? AND "expenses"."data" BETWEEN ? AND ?  [["user_id", 1], ["data", "2020-12-03"], ["data", "2020-12-04"]]
---
  def index
    @data_inicio = params[:data_inicio]
    @data_fim = params[:data_final]
    @total_receitas_mes = 0
    if @data_inicio == "" and @data_fim == ""
      @expenses = Expense.where(user_id: current_user.id)
    elsif @data_inicio and @data_fim
      @expenses = Expense.where(user_id: current_user.id,:data => @data_inicio..@data_fim)
      @total_receitas_mes = Expense.where(user_id: current_user.id,:data => @data_inicio..@data_fim).pluck('SUM(quantidade)')[0]
    else
      @expenses = Expense.where(user_id: current_user.id)

INSERT INTO "expenses" ("quantidade", "data", "comentario", "created_at", "updated_at", "user_id", "expensetype_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["quantidade", 3.0], ["data", "2020-12-14"], ["comentario", ""], ["created_at", "2020-12-14 12:27:31.556123"], ["updated_at", "2020-12-14 12:27:31.556123"], ["user_id", 1], ["expensetype_id", 1]]
---
  def create
    @expense = Expense.new(expense_params)
    @expense.user_id = current_user.id

    respond_to do |format|
      if @expense.save

DELETE FROM "expenses" WHERE "expenses"."id" = ?  [["id", 2]]
---
  def destroy
    @expense.destroy

SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_expense
      @expense = Expense.find(params[:id])