gerenciamentocontas/app/controllers/expenses_controller.rb

SELECT "expenses".* FROM "expenses"
---
  def index
    @expenses = Expense.all