gerenciamentocontas/app/views/expenses/_form.html.erb

    <%= form.label :Receita %>
    <%= form.collection_select(:expensetype_id,Expensetype.all,:id,:tipo_receita,include_blank: false) %>
---
SELECT "expensetypes".* FROM "expensetypes"