gerenciamentocontas/app/views/expenses/index.html.erb

SELECT "expensetypes".* FROM "expensetypes" WHERE "expensetypes"."expense_id" = ? LIMIT ?  [["expense_id", 1], ["LIMIT", 1]]
---
        <td><%= expense.comentario %></td>
        <td><%= Expensetype.find(expense.expensetype_id) %></td>