gerenciamentocontas/app/views/accounts/_form.html.erb

    <%= form.label :Conta %>
    <%= form.collection_select(:accounttype_id,Accounttype.all,:id,:tipo_conta,include_blank: false) %>
---
SELECT "accounttypes".* FROM "accounttypes"