gerenciamentocontas/app/views/accounts/index.html.erb

        <td><%= current_user.email %></td>
        <td><%= Accounttype.find(account.accounttype_id) %></td>
---
SELECT "accounttypes".* FROM "accounttypes" WHERE "accounttypes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]