gerenciamentolivros/app/controllers/authors_controller.rb

SELECT "authors".* FROM "authors"
---
  def index
    @authors = Author.all

SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def adicionar_livro
    @author = Author.find(params[:id])

INSERT INTO "authors" ("nome", "created_at", "updated_at", "book_id") VALUES (?, ?, ?, ?)  [["nome", "maria"], ["created_at", "2020-09-24 13:38:01.948911"], ["updated_at", "2020-09-24 13:38:01.948911"], ["book_id", 1]]
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save

UPDATE "authors" SET "book_id" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["book_id", 2], ["updated_at", "2020-09-24 13:40:38.516739"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @author.update(author_params)

SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_author
      @author = Author.find(params[:id])