gerenciamentolivros/app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (nome_livro like '%a%')
SELECT "books".* FROM "books"
---
  def index
    if params[:search]
      @books = Book.where("nome_livro like '%#{params[:search]}%'")
    else
      @books = Book.all

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "authors".* FROM "authors" WHERE "authors"."book_id" = ?  [["book_id", 1]]
SELECT SUM(qtd_lido) FROM "reads" WHERE "reads"."book_id" = ?  [["book_id", 1]]
---
  def autores_livro

    @book = Book.find(params[:id])
    @authors = Author.where(book_id: @book.id)
    @total_leituras = Read.where(book_id: @book.id).pluck('SUM(qtd_lido)')

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reads".* FROM "reads" WHERE "reads"."book_id" = ?  [["book_id", 1]]
---
  def leituras
    @book = Book.find(params[:id])
    @read = Read.where(book_id: @book.id)

INSERT INTO "books" ("nome_livro", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nome_livro", "A cabana"], ["status", 1], ["created_at", "2020-09-24 13:20:40.676578"], ["updated_at", "2020-09-24 13:20:40.676578"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save