gerenciamentolivros/app/controllers/reads_controller.rb

  def index
    @reads = Read.all
---
SELECT "reads".* FROM "reads"

  def create
    @read = Read.new(read_params)

    respond_to do |format|
      if @read.save
---
INSERT INTO "reads" ("data_leitura", "qtd_lido", "created_at", "updated_at", "book_id") VALUES (?, ?, ?, ?, ?)  [["data_leitura", "2020-09-27"], ["qtd_lido", 4], ["created_at", "2020-09-27 00:29:46.522899"], ["updated_at", "2020-09-27 00:29:46.522899"], ["book_id", 1]]

    def set_read
      @read = Read.find(params[:id])
---
SELECT "reads".* FROM "reads" WHERE "reads"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]