gerenciamentolivros/app/views/reads/_form.html.erb

    <%= form.label :book_id %>
    <%= form.collection_select(:book_id,Book.all,:id,:nome_livro,include_blank: true) %>
---
SELECT "books".* FROM "books"